{"config": [{"config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "batch_input_shape": [null, 32, 32, 3], "name": "convolution2d_8", "W_regularizer": null, "nb_row": 5, "bias": true, "nb_col": 5, "dim_ordering": "tf", "input_dtype": "float32", "nb_filter": 32, "subsample": [1, 1], "W_constraint": null, "border_mode": "same", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "border_mode": "same", "activation": "linear", "name": "convolution2d_9", "W_regularizer": null, "nb_row": 5, "bias": true, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "nb_filter": 32, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "name": "dense_7", "bias": true, "W_regularizer": null, "output_dim": 256, "W_constraint": null, "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "trainable": true, "activation": "linear", "name": "dense_8", "bias": true, "W_regularizer": null, "output_dim": 10, "W_constraint": null, "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_17", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}